Revit 2027 API
RepeatingReferenceSource Methods
The RepeatingReferenceSource type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBounds |  Returns information about the boundaries of the repeating reference array.
GetDefaultRepeatingReferenceSource |  Returns the default repeating reference source for a given element.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetReference |  Returns an individual repeating reference given by coordinates in the array, or null if there is no reference at the coordinates (for example if there is a hole in a divided surface.)
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasRepeatingReferenceSource |  Determines whether an element has any repeating reference sources that can be used when creating component repeaters.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RepeatingReferenceSource Class
Autodesk.Revit.DB Namespace